online_benchmark_log/mi35x/DeepSeek-R1-MXFP4-Preview/v0.5.5.post3-rocm700-mi35x-20251119_DeepSeek-R1-MXFP4-Preview_FP8_online/sglang_serving_benchmark_concurrency_1_run1_20251119_160719.log
Run started at: 2025-11-19 16:07:19 PST
Using 128 prompts for concurrency 1
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model=None, served_model_name=None, tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3200, random_output_len=800, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, profile_activities=['CPU', 'GPU'], lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=30000, dataset_name='random', dataset_path='', model='/mnt/raid/models/deepseek-ai/amd-DeepSeek-R1-MXFP4-Preview', served_model_name=None, tokenizer=None, num_prompts=128, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=3200, random_output_len=800, random_range_ratio=1.0, image_count=1, image_resolution='1080p', image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=1, output_file=None, output_details=False, disable_tqdm=False, disable_stream=False, return_logprob=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, profile_activities=['CPU', 'GPU'], lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', tag=None)

#Input tokens: 409600
#Output tokens: 102400
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
100%|██████████| 128/128 [58:04<00:00, 27.23s/it]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 1         
Successful requests:                     128       
Benchmark duration (s):                  3484.88   
Total input tokens:                      409600    
Total input text tokens:                 409600    
Total input vision tokens:               0         
Total generated tokens:                  102400    
Total generated tokens (retokenized):    101999    
Request throughput (req/s):              0.04      
Input token throughput (tok/s):          117.54    
Output token throughput (tok/s):         29.38     
Total token throughput (tok/s):          146.92    
Concurrency:                             1.00      
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   27224.70  
Median E2E Latency (ms):                 27203.29  
---------------Time to First Token----------------
Mean TTFT (ms):                          132.80    
Median TTFT (ms):                        131.63    
P99 TTFT (ms):                           180.56    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          33.91     
Median TPOT (ms):                        33.88     
P99 TPOT (ms):                           34.70     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           33.91     
Median ITL (ms):                         33.88     
P95 ITL (ms):                            33.96     
P99 ITL (ms):                            33.99     
Max ITL (ms):                            727.36    
==================================================
Run completed at: 2025-11-19 17:05:34 PST
Run duration: 3495 seconds